## 데이터프레임 인덱스 조작

### 인덱스 설정 및 제거

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(2021)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.61  0.13   0.1
1  B  0.73  0.18  0.06
2  C  0.14  0.75  0.96
3  D  0.31  0.66  0.62
4  E   1.0  0.78  0.09

In [5]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.61  0.13   0.1
B   0.73  0.18  0.06
C   0.14  0.75  0.96
D   0.31  0.66  0.62
E    1.0  0.78  0.09

In [6]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.61  0.13   0.1
1  B  0.73  0.18  0.06
2  C  0.14  0.75  0.96
3  D  0.31  0.66  0.62
4  E   1.0  0.78  0.09

In [8]:
df2.reset_index(inplace=True)
df2

   index C1    C2    C3    C4
0      0  A  0.61  0.13   0.1
1      1  B  0.73  0.18  0.06
2      2  C  0.14  0.75  0.96
3      3  D  0.31  0.66  0.62
4      4  E   1.0  0.78  0.09

연습 문제 4.5.1

5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.

학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [10]:
np.random.seed(2021)
data = np.random.randint(40, 100, size=(5, 3))
df_score1 = pd.DataFrame(data, columns=['국어', '영어', '수학'])
df_score1

   국어  영어  수학
0  92  61  97
1  40  85  70
2  62  84  67
3  69  61  69
4  64  52  94

In [18]:
df_score1.index = ['Ail', 'Bath', 'Clik', 'Doun', 'Eater']
df_score1.index.name = 'Name'
df_score1

       국어  영어  수학
Name
Ail    92  61  97
Bath   40  85  70
Clik   62  84  67
Doun   69  61  69
Eater  64  52  94

In [24]:
df_score2 = df_score1.reset_index()
df_score2

    Name  국어  영어  수학
0    Ail  92  61  97
1   Bath  40  85  70
2   Clik  62  84  67
3   Doun  69  61  69
4  Eater  64  52  94

In [25]:
# df_score2.set_index('Name', inplace=True)
df_score2 = df_score2.set_index('Name')
df_score2

       국어  영어  수학
Name
Ail    92  61  97
Bath   40  85  70
Clik   62  84  67
Doun   69  61  69
Eater  64  52  94

### 다중 인덱스

In [26]:
np.random.seed(2021)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.49  0.68 -0.42 -0.81
      id_2   0.56 -0.71  1.13  0.65
      id_3   0.11  0.42  0.12 -0.84
F     id_1   0.41  0.10 -1.91  1.10
      id_2  -1.40 -0.23 -1.34  0.30
      id_3  -0.72  2.54  1.32  0.07